package com.becomedev.unliminetpro

import com.becomedev.unliminetpro.model.NetworkData

class AddData {
    /*fun addDataTrue() : ArrayList<NetworkData>{
        val listTrue = ArrayList<NetworkData>()
        listTrue.add(NetworkData("true",22,1,"*900*3703*17259619# ","เน็ตไม่จำกัด","512 Kbps ไม่ลดสปีด"))
        listTrue.add((NetworkData("true",25,1,"*900*3704*17259619#","เน็ตไม่จำกัด","1 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",28,1,"*900*3705*17259619#","เน็ตไม่จำกัด","2 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",32,1,"*900*3706*17259619#","เน็ตไม่จำกัด","4 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",45,1,"*900*3707*17259619#","เน็ตไม่จำกัด","6 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",55,1,"*900*3708*17259619#","เน็ตไม่จำกัด","10 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",9,1," *900*3301*17259619#","100 MB","ใช้เน็ตความเร็วสูงสุด")))
        listTrue.add((NetworkData("true",15,1,"*900*3306*17259619#","200 MB","ใช้เน็ตความเร็วสูงสุด")))
        listTrue.add((NetworkData("true",39,1,"*900*1924*17259619#","1.5 GB","ใช้เน็ตความเร็วสูงสุด")))
        listTrue.add((NetworkData("true",99,1,"*900*1926*17259619#"," 2 GB","ใช้เน็ตความเร็วสูงสุด")))

        listTrue.add((NetworkData("true",45,2,"*900*3709*17259619#","เน็ตไม่จำกัด","1 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",59,2,"*900*3710*17259619#","เน็ตไม่จำกัด","4 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",85,2,"*900*3711*17259619#","เน็ตไม่จำกัด","6 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",100,2,"*900*3712*17259619# ","เน็ตไม่จำกัด","10 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",35,2,"*900*8334*17259619# ","เน็ตไม่จำกัด","1 Mbps จนครบ 750 MB แล้วความเร็วจะลดเหลือ 128 Kbps")))
        listTrue.add((NetworkData("true",45,2,"*900*8336*17259619#","เน็ตไม่จำกัด","2 Mbps จนครบ 1.2 GB แล้วความเร็วจะลดเหลือ 128 Kbps")))
        listTrue.add((NetworkData("true",55,2,"*900*8339*17259619#","เน็ตไม่จำกัด","4 Mbps จนครบ 1.75 GB แล้วความเร็วจะลดเหลือ 128 Kbps")))
        listTrue.add((NetworkData("true",75,2,"*900*8340*17259619#","เน็ตไม่จำกัด","6 Mbps จนครบ 2.5 GB แล้วความเร็วจะลดเหลือ 128 Kbps")))
        listTrue.add((NetworkData("true",85,2,"*900*8341*17259619#","เน็ตไม่จำกัด","10 Mbps จนครบ 3.5 GB แล้วความเร็วจะลดเหลือ 128 Kbps")))

        listTrue.add((NetworkData("true",60,3,"*900*3765*17259619#","เน็ตไม่จำกัด ","1 Mbps ไม่ลดสปีด","โทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที")))
        listTrue.add((NetworkData("true",100,3,"*900*3766*17259619#","เน็ตไม่จำกัด ","4 Mbps ไม่ลดสปีด","โทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที")))

        listTrue.add((NetworkData("true",89,7,"*900*3713*17259619#","เน็ตไม่จำกัด","512 Kbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",120,7,"*900*3714*17259619#","เน็ตไม่จำกัด","1 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",150,7,"*900*3715*17259619#","เน็ตไม่จำกัด","2 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",220,7,"*900*3716*17259619#","เน็ตไม่จำกัด","4 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",270,7,"*900*3717*17259619# ","เน็ตไม่จำกัด","6 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",330,7,"*900*3718*17259619#","เน็ตไม่จำกัด"," 10 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",129,7,"*900*3767*17259619# ","เน็ตไม่จำกัด","1 Mbps ไม่ลดสปีด","โทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที")))
        listTrue.add((NetworkData("true",229,7,"*900*3768*17259619#","เน็ตไม่จำกัด","4 Mbps ไม่ลดสปีด","โทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที")))

        listTrue.add((NetworkData("true",250,15,"*900*3769*17259619# ","เน็ตไม่จำกัด","1 Mbps ไม่ลดสปีด","โทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที")))
        listTrue.add((NetworkData("true",365,15,"*900*3770*17259619#","เน็ตไม่จำกัด","4 Mbps ไม่ลดสปีด","โทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที")))

        listTrue.add((NetworkData("true",300,30,"*900*3719*17259619#","เน็ตไม่จำกัด","512 Kbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",350,30,"*900*3720*17259619#","เน็ตไม่จำกัด","1 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",450,30,"*900*3721*17259619#","เน็ตไม่จำกัด","2 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",650,30,"*900*3722*17259619#","เน็ตไม่จำกัด","4 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",850,30,"*900*3723*17259619# ","เน็ตไม่จำกัด","6 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",500,30,"*900*1991*17259619#","เน็ตไม่จำกัด","1 Mbps ไม่ลดสปีด","ทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที","ใช้งาน TrueMove-H Wifi ฟรี")))
        listTrue.add((NetworkData("true",650,30,"*900*1993*17259619#","เน็ตไม่จำกัด","4 Mbps ไม่ลดสปีด","โทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที","ใช้งาน TrueMove-H Wifi ฟรี")))
        listTrue.add((NetworkData("true",199,30,"*900*8837*17259619# ","เน็ตไม่จำกัด ","สูงสุด จนครบ 1.5 GB แล้วความเร็วจะลดเหลือ 128Kbps")))
        listTrue.add((NetworkData("true",300,30,"*900*8321*17259619#","เน็ตไม่จำกัด ","512 Kbps จนครบ 7.5 GB แล้วความเร็วจะลดเหลือ 128 Kbps")))
        listTrue.add((NetworkData("true",350,30,"*900*8324*17259619#","เน็ตไม่จำกัด ","1 Mbps จนครบ 7.5 GB แล้วความเร็วจะลดเหลือ 128 Kbps")))
        listTrue.add((NetworkData("true",450,30,"*900*8338*17259619# ","เน็ตไม่จำกัด ","2 Mbps จนครบ 12.5 GB แล้วความเร็วจะลดเหลือ 128 Kbps")))
        listTrue.add((NetworkData("true",650,30,"*900*8327*17259619#","เน็ตไม่จำกัด ","4 Mbps จนครบ 20 GB แล้วความเร็วจะลดเหลือ 128 Kbps")))
        listTrue.add((NetworkData("true",850,30,"*900*8330*17259619#","เน็ตไม่จำกัด ","6 Mbps จนครบ 25 GB แล้วความเร็วจะลดเหลือ 128 Kbps")))
        listTrue.add((NetworkData("true",1100,30,"*900*8333*17259619#","เน็ตไม่จำกัด ","10 Mbps จนครบ 33 GB แล้วความเร็วจะลดเหลือ 128 Kbps")))

        listTrue.add((NetworkData("true",750,90,"*900*1794*17259619#","เน็ตไม่จำกัด "," 1 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",1000,90,"*900*8346*17259619#","เน็ตไม่จำกัด ","2 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",1200,90,"*900*1795*17259619#","เน็ตไม่จำกัด ","4 Mbps ไม่ลดสปีด","โทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที")))

        listTrue.add((NetworkData("true",1200,183,"*900*9959*17259619#","เน็ตไม่จำกัด","1 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",1500,183,"*900*9738*17259619#","เน็ตไม่จำกัด","2 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",2100,183,"*900*9961*17259619#","เน็ตไม่จำกัด","4 Mbps ไม่ลดสปีด","โทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที")))

        listTrue.add((NetworkData("true",1800,365,"*900*9960*17259619#","เน็ตไม่จำกัด","1 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",2600,365,"*900*9737*17259619#","เน็ตไม่จำกัด","2 Mbps ไม่ลดสปีด")))
        listTrue.add((NetworkData("true",3600,365,"*900*9962*17259619#","เน็ตไม่จำกัด","4 Mbps ไม่ลดสปีด","โทรฟรี ในเครือข่าย ไม่จำกัดครั้ง ครั้งละไม่เกิน 60 นาที")))

        return listTrue
    }*/
}